package jiebago

import "testing"

var (
	seg          Segmenter
	testContents = []string{
		"這是一個伸手不見五指的黑夜。我叫孫悟空，我愛北京，我愛Python和C++。",
		"我不喜歡日本和服。",
		"雷猴回歸人間。",
		"工信處女幹事每月經過下屬科室都要親口交代24口交換機等技術性器件的安裝工作",
		"我需要廉租房",
		"永和服裝飾品有限公司",
		"我愛北京天安門",
		"abc",
		"隱馬爾可夫",
		"雷猴是個好網站",
		"「Microsoft」一詞由「MICROcomputer（微型計算機）」和「SOFTware（軟件）」兩部分組成",
		"草泥馬和欺實馬是今年的流行詞彙",
		"伊藤洋華堂總府店",
		"中國科學院計算技術研究所",
		"羅密歐與朱麗葉",
		"我購買了道具和服裝",
		"PS: 我覺得開源有一個好處，就是能夠敦促自己不斷改進，避免敞帚自珍",
		"湖北省石首市",
		"湖北省十堰市",
		"總經理完成了這件事情",
		"電腦修好了",
		"做好了這件事情就一了百了了",
		"人們審美的觀點是不同的",
		"我們買了一個美的空調",
		"線程初始化時我們要注意",
		"一個分子是由好多原子組織成的",
		"祝你馬到功成",
		"他掉進了無底洞里",
		"中國的首都是北京",
		"孫君意",
		"外交部發言人馬朝旭",
		"領導人會議和第四屆東亞峰會",
		"在過去的這五年",
		"還需要很長的路要走",
		"60週年首都閱兵",
		"你好人們審美的觀點是不同的",
		"買水果然後來世博園",
		"買水果然後去世博園",
		"但是後來我才知道你是對的",
		"存在即合理",
		"的的的的的在的的的的就以和和和",
		"I love你，不以為恥，反以為rong",
		"因",
		"",
		"hello你好人們審美的觀點是不同的",
		"很好但主要是基於網頁形式",
		"hello你好人們審美的觀點是不同的",
		"為什麼我不能擁有想要的生活",
		"後來我才",
		"此次來中國是為了",
		"使用了它就可以解決一些問題",
		",使用了它就可以解決一些問題",
		"其實使用了它就可以解決一些問題",
		"好人使用了它就可以解決一些問題",
		"是因為和國家",
		"老年搜索還支持",
		"乾脆就把那部蒙人的閒法給廢了拉倒！RT @laoshipukong : 27日，全國人大常委會第三次審議侵權責任法草案，刪除了有關醫療損害責任「舉證倒置」的規定。在醫患糾紛中本已處於弱勢地位的消費者由此將陷入萬劫不復的境地。 ",
		"大",
		"",
		"他說的確實在理",
		"長春市長春節講話",
		"結婚的和尚未結婚的",
		"結合成分子時",
		"旅遊和服務是最好的",
		"這件事情的確是我的錯",
		"供大家參考指正",
		"哈爾濱政府公佈塌橋原因",
		"我在機場入口處",
		"邢永臣攝影報道",
		"BP神經網絡如何訓練才能在分類時增加區分度？",
		"南京市長江大橋",
		"應一些使用者的建議，也為了便於利用NiuTrans用於SMT研究",
		"長春市長春藥店",
		"鄧穎超生前最喜歡的衣服",
		"胡錦濤是熱愛世界和平的政治局常委",
		"程序員祝海林和朱會震是在孫健的左面和右面, 範凱在最右面.再往左是李松洪",
		"一次性交多少錢",
		"兩塊五一套，三塊八一斤，四塊七一本，五塊六一條",
		"小和尚留了一個像大和尚一樣的和尚頭",
		"我是中華人民共和國公民;我爸爸是共和黨黨員; 地鐵和平門站",
		"張曉梅去人民醫院做了個B超然後去買了件T恤",
		"AT&T是一件不錯的公司，給你發offer了嗎？",
		"C++和c#是什麼關係？11+122=133，是嗎？PI=3.14159",
		"你認識那個和主席握手的的哥嗎？他開一輛黑色的士。",
		"槍桿子中出政權"}

	defaultCutResult = [][]string{[]string{"這是", "一個", "伸手不見五指", "的", "黑夜", "。", "我", "叫", "孫悟空", "，", "我", "愛", "北京", "，", "我", "愛", "Python", "和", "C++", "。"},
		[]string{"我", "不", "喜歡", "日本", "和服", "。"},
		[]string{"雷猴", "回歸", "人間", "。"},
		[]string{"工信處", "女幹事", "每月", "經過", "下屬", "科室", "都", "要", "親口", "交代", "24", "口", "交換機", "等", "技術性", "器件", "的", "安裝", "工作"},
		[]string{"我", "需要", "廉租房"},
		[]string{"永和", "服裝", "飾品", "有限公司"},
		[]string{"我", "愛", "北京", "天安門"},
		[]string{"abc"},
		[]string{"隱", "馬爾可夫"},
		[]string{"雷猴", "是", "個", "好", "網站"},
		[]string{"「", "Microsoft", "」", "一詞", "由", "「", "MICROcomputer", "（", "微型", "計算機", "）", "」", "和", "「", "SOFTware", "（", "軟件", "）", "」", "兩", "部分", "組成"},
		[]string{"草泥馬", "和", "欺實", "馬", "是", "今年", "的", "流行", "詞彙"},
		[]string{"伊藤", "洋華堂", "總府", "店"},
		[]string{"中國科學院計算技術研究所"},
		[]string{"羅密歐", "與", "朱麗葉"},
		[]string{"我", "購買", "了", "道具", "和", "服裝"},
		[]string{"PS", ":", " ", "我", "覺得", "開源", "有", "一個", "好處", "，", "就是", "能夠", "敦促", "自己", "不斷改進", "，", "避免", "敞帚", "自珍"},
		[]string{"湖北省", "石首市"},
		[]string{"湖北省", "十堰市"},
		[]string{"總經理", "完成", "了", "這件", "事情"},
		[]string{"電腦", "修好", "了"},
		[]string{"做好", "了", "這件", "事情", "就", "一了百了", "了"},
		[]string{"人們", "審美", "的", "觀點", "是", "不同", "的"},
		[]string{"我們", "買", "了", "一個", "美的", "空調"},
		[]string{"線程", "初始化", "時", "我們", "要", "注意"},
		[]string{"一個", "分子", "是", "由", "好多", "原子", "組織", "成", "的"},
		[]string{"祝", "你", "馬到功成"},
		[]string{"他", "掉", "進", "了", "無底洞", "里"},
		[]string{"中國", "的", "首都", "是", "北京"},
		[]string{"孫君意"},
		[]string{"外交部", "發言人", "馬朝旭"},
		[]string{"領導人", "會議", "和", "第四屆", "東亞", "峰會"},
		[]string{"在", "過去", "的", "這", "五年"},
		[]string{"還", "需要", "很長", "的", "路", "要", "走"},
		[]string{"60", "週年", "首都", "閱兵"},
		[]string{"你好", "人們", "審美", "的", "觀點", "是", "不同", "的"},
		[]string{"買", "水果", "然後", "來", "世博園"},
		[]string{"買", "水果", "然後", "去", "世博園"},
		[]string{"但是", "後來", "我", "才", "知道", "你", "是", "對", "的"},
		[]string{"存在", "即", "合理"},
		[]string{"的", "的", "的", "的", "的", "在", "的", "的", "的", "的", "就", "以", "和", "和", "和"},
		[]string{"I", " ", "love", "你", "，", "不以為恥", "，", "反", "以為", "rong"},
		[]string{"因"},
		[]string{},
		[]string{"hello", "你好", "人們", "審美", "的", "觀點", "是", "不同", "的"},
		[]string{"很", "好", "但", "主要", "是", "基於", "網頁", "形式"},
		[]string{"hello", "你好", "人們", "審美", "的", "觀點", "是", "不同", "的"},
		[]string{"為什麼", "我", "不能", "擁有", "想要", "的", "生活"},
		[]string{"後來", "我", "才"},
		[]string{"此次", "來", "中國", "是", "為了"},
		[]string{"使用", "了", "它", "就", "可以", "解決", "一些", "問題"},
		[]string{",", "使用", "了", "它", "就", "可以", "解決", "一些", "問題"},
		[]string{"其實", "使用", "了", "它", "就", "可以", "解決", "一些", "問題"},
		[]string{"好人", "使用", "了", "它", "就", "可以", "解決", "一些", "問題"},
		[]string{"是因為", "和", "國家"},
		[]string{"老年", "搜索", "還", "支持"},
		[]string{"乾脆", "就", "把", "那部", "蒙人", "的", "閒法", "給", "廢", "了", "拉倒", "！", "RT", " ", "@", "laoshipukong", " ", ":", " ", "27", "日", "，", "全國人大常委會", "第三次", "審議", "侵權", "責任法", "草案", "，", "刪除", "了", "有關", "醫療", "損害", "責任", "「", "舉證", "倒置", "」", "的", "規定", "。", "在", "醫患", "糾紛", "中本", "已", "處於", "弱勢", "地位", "的", "消費者", "由此", "將", "陷入", "萬劫不復", "的", "境地", "。", " "},
		[]string{"大"},
		[]string{},
		[]string{"他", "說", "的", "確實", "在理"},
		[]string{"長春", "市長", "春節", "講話"},
		[]string{"結婚", "的", "和", "尚未", "結婚", "的"},
		[]string{"結合", "成", "分子", "時"},
		[]string{"旅遊", "和", "服務", "是", "最好", "的"},
		[]string{"這件", "事情", "的確", "是", "我", "的", "錯"},
		[]string{"供", "大家", "參考", "指正"},
		[]string{"哈爾濱", "政府", "公佈", "塌橋", "原因"},
		[]string{"我", "在", "機場", "入口處"},
		[]string{"邢永臣", "攝影", "報道"},
		[]string{"BP", "神經網絡", "如何", "訓練", "才能", "在", "分類", "時", "增加", "區分度", "？"},
		[]string{"南京市", "長江大橋"},
		[]string{"應", "一些", "使用者", "的", "建議", "，", "也", "為了", "便於", "利用", "NiuTrans", "用於", "SMT", "研究"},
		[]string{"長春市", "長春", "藥店"},
		[]string{"鄧穎超", "生前", "最", "喜歡", "的", "衣服"},
		[]string{"胡錦濤", "是", "熱愛", "世界", "和平", "的", "政治局", "常委"},
		[]string{"程序員", "祝", "海林", "和", "朱會震", "是", "在", "孫健", "的", "左面", "和", "右面", ",", " ", "範凱", "在", "最", "右面", ".", "再往", "左", "是", "李松洪"},
		[]string{"一次性", "交", "多少", "錢"},
		[]string{"兩塊", "五", "一套", "，", "三塊", "八", "一斤", "，", "四塊", "七", "一本", "，", "五塊", "六", "一條"},
		[]string{"小", "和尚", "留", "了", "一個", "像", "大", "和尚", "一樣", "的", "和尚頭"},
		[]string{"我", "是", "中華人民共和國", "公民", ";", "我", "爸爸", "是", "共和黨", "黨員", ";", " ", "地鐵", "和平門", "站"},
		[]string{"張曉梅", "去", "人民", "醫院", "做", "了", "個", "B超", "然後", "去", "買", "了", "件", "T恤"},
		[]string{"AT&T", "是", "一件", "不錯", "的", "公司", "，", "給", "你", "發", "offer", "了", "嗎", "？"},
		[]string{"C++", "和", "c#", "是", "什麼", "關係", "？", "11", "+", "122", "=", "133", "，", "是", "嗎", "？", "PI", "=", "3.14159"},
		[]string{"你", "認識", "那個", "和", "主席", "握手", "的", "的哥", "嗎", "？", "他開", "一輛", "黑色", "的士", "。"},
		[]string{"槍桿子", "中", "出", "政權"},
	}

	cutAllResult = [][]string{[]string{"這", "是", "一個", "伸手", "伸手不見", "伸手不見五指", "不見", "五指", "的", "黑夜", "", "", "我", "叫", "孫悟空", "悟空", "", "", "我", "愛", "北京", "", "", "我", "愛", "Python", "和", "C++", ""},
		[]string{"我", "不", "喜歡", "日本", "和服", "", ""},
		[]string{"雷猴", "回歸", "人間", "", ""},
		[]string{"工信處", "處女", "女幹事", "幹事", "每月", "月經", "經過", "下屬", "科室", "都", "要", "親口", "口交", "交代", "24", "口交", "交換", "交換機", "換機", "等", "技術", "技術性", "性器", "器件", "的", "安裝", "安裝工", "裝工", "工作"},
		[]string{"我", "需要", "廉租", "廉租房", "租房"},
		[]string{"永和", "和服", "服裝", "裝飾", "裝飾品", "飾品", "有限", "有限公司", "公司"},
		[]string{"我", "愛", "北京", "天安", "天安門"},
		[]string{"abc"},
		[]string{"隱", "馬爾可", "馬爾可夫", "可夫"},
		[]string{"雷猴", "是", "個", "好", "網站"},
		[]string{"", "Microsoft", "", "一", "詞", "由", "", "MICROcomputer", "", "微型", "計算", "計算機", "算機", "", "", "", "和", "", "SOFTware", "", "軟件", "", "", "", "兩部", "部分", "分組", "組成"},
		[]string{"草泥馬", "和", "欺", "實", "馬", "是", "今年", "的", "流行", "詞彙"},
		[]string{"伊", "藤", "洋華堂", "總府", "店"},
		[]string{"中國", "中國科學院", "中國科學院計算技術研究所", "科學", "科學院", "學院", "計算", "計算技術", "技術", "研究", "研究所"},
		[]string{"羅密歐", "與", "朱麗葉"},
		[]string{"我", "購買", "了", "道具", "和服", "服裝"},
		[]string{"PS", "", "", "我", "覺得", "開源", "有", "一個", "好處", "", "", "就是", "能夠", "敦促", "自己", "不斷", "不斷改進", "改進", "", "", "避免", "敞", "帚", "自珍"},
		[]string{"湖北", "湖北省", "石首", "石首市"},
		[]string{"湖北", "湖北省", "十堰", "十堰市"},
		[]string{"總經理", "經理", "理完", "完成", "了", "這件", "事情"},
		[]string{"電腦", "修好", "了"},
		[]string{"做好", "了", "這件", "事情", "就", "一了百了", "了了"},
		[]string{"人們", "審美", "美的", "觀點", "是", "不同", "的"},
		[]string{"我們", "買", "了", "一個", "美的", "空調"},
		[]string{"線程", "初始", "初始化", "化時", "我們", "要", "注意"},
		[]string{"一個", "分子", "是", "由", "好多", "原子", "組織", "織成", "的"},
		[]string{"祝", "你", "馬到功成"},
		[]string{"他", "掉", "進", "了", "無底", "無底洞", "里"},
		[]string{"中國", "的", "首都", "是", "北京"},
		[]string{"孫", "君", "意"},
		[]string{"外交", "外交部", "部發", "發言", "發言人", "人馬", "馬朝旭"},
		[]string{"領導", "領導人", "會議", "議和", "第四", "第四屆", "四屆", "東亞", "峰會"},
		[]string{"在", "過去", "的", "這", "五年"},
		[]string{"還", "需要", "很", "長", "的", "路", "要", "走"},
		[]string{"60", "週年", "首都", "閱兵"},
		[]string{"你好", "好人", "人們", "審美", "美的", "觀點", "是", "不同", "的"},
		[]string{"買", "水果", "果然", "然後", "後來", "來世", "世博", "世博園", "博園"},
		[]string{"買", "水果", "果然", "然後", "後去", "去世", "世博", "世博園", "博園"},
		[]string{"但是", "後來", "我", "才", "知道", "你", "是", "對", "的"},
		[]string{"存在", "即", "合理"},
		[]string{"的", "的", "的", "的", "的", "在", "的", "的", "的", "的", "就", "以", "和", "和", "和"},
		[]string{"I", "love", "你", "", "", "不以", "不以為恥", "以為", "恥", "", "", "反", "以為", "rong"},
		[]string{"因"},
		[]string{},
		[]string{"hello", "你好", "好人", "人們", "審美", "美的", "觀點", "是", "不同", "的"},
		[]string{"很", "好", "但", "主要", "要是", "基於", "網頁", "形式"},
		[]string{"hello", "你好", "好人", "人們", "審美", "美的", "觀點", "是", "不同", "的"},
		[]string{"為什麼", "什麼", "我", "不能", "擁有", "想要", "的", "生活"},
		[]string{"後來", "我", "才"},
		[]string{"此次", "來", "中國", "國是", "為了"},
		[]string{"使用", "了", "它", "就", "可以", "解決", "一些", "問題"},
		[]string{"", "", "使用", "了", "它", "就", "可以", "解決", "一些", "問題"},
		[]string{"其實", "使用", "了", "它", "就", "可以", "解決", "一些", "問題"},
		[]string{"好人", "使用", "了", "它", "就", "可以", "解決", "一些", "問題"},
		[]string{"是因為", "因為", "和", "國家"},
		[]string{"老年", "搜索", "索還", "支持"},
		[]string{"乾脆", "就", "把", "那部", "蒙人", "的", "閒", "法", "給", "廢", "了", "拉倒", "", "RT", "", "laoshipukong", "", "", "27", "日", "", "", "全國", "全國人大", "全國人大常委會", "國人", "人大", "人大常委會", "常委", "常委會", "委會", "第三", "第三次", "三次", "審議", "侵權", "權責", "責任", "責任法", "草案", "", "", "刪除", "除了", "有關", "醫療", "損害", "責任", "", "", "舉證", "倒置", "", "", "的", "規定", "", "", "在", "醫患", "糾紛", "中", "本", "已", "處於", "弱勢", "地位", "的", "消費", "消費者", "由此", "將", "陷入", "萬劫不復", "不復", "的", "境地", "", "", ""},
		[]string{"大"},
		[]string{},
		[]string{"他", "說", "的確", "確實", "實在", "理"},
		[]string{"長春", "長春市", "市長", "長春", "春節", "講話"},
		[]string{"結婚", "的", "和尚", "尚未", "未結", "結婚", "的"},
		[]string{"結合", "合成", "成分", "分子", "時"},
		[]string{"旅遊", "和服", "服務", "是", "最好", "的"},
		[]string{"這件", "事情", "的確", "是", "我", "的", "錯"},
		[]string{"供", "大家", "參考", "指正"},
		[]string{"哈爾", "哈爾濱", "政府", "公佈", "塌", "橋", "原因"},
		[]string{"我", "在", "機場", "入口", "入口處"},
		[]string{"邢", "永", "臣", "攝影", "報道"},
		[]string{"BP", "神經", "神經網", "神經網絡", "網絡", "如何", "訓練", "才能", "在", "分類", "時", "增加", "加區", "區分", "區分度", "分度", "", ""},
		[]string{"南京", "南京市", "京市", "市長", "長江", "長江大橋", "大橋"},
		[]string{"應", "一些", "使用", "使用者", "用者", "的", "建議", "", "", "也", "為了", "便於", "利用", "NiuTrans", "用於", "SMT", "研究"},
		[]string{"長春", "長春市", "市長", "長春", "春藥", "藥店"},
		[]string{"鄧穎超", "超生", "生前", "最", "喜歡", "的", "衣服"},
		[]string{"胡錦濤", "錦濤", "是", "熱愛", "世界", "和平", "的", "政治", "政治局", "常委"},
		[]string{"程序", "程序員", "祝", "海林", "和", "朱", "會", "震", "是", "在", "孫", "健", "的", "左面", "和", "右面", "", "", "", "範", "凱", "在", "最", "右面", "", "", "再往", "左", "是", "李", "松", "洪"},
		[]string{"一次", "一次性", "性交", "多少", "多少錢"},
		[]string{"兩塊", "五一", "一套", "", "", "三塊", "八一", "一斤", "", "", "四塊", "七一", "一本", "", "", "五塊", "六一", "一條"},
		[]string{"小", "和尚", "留", "了", "一個", "像", "大", "和尚", "一樣", "的", "和尚", "和尚頭"},
		[]string{"我", "是", "中華", "中華人民", "中華人民共和國", "華人", "人民", "人民共和國", "共和", "共和國", "國公", "公民", "", "", "我", "爸爸", "是", "共和", "共和黨", "黨員", "", "", "", "地鐵", "和平", "和平門", "站"},
		[]string{"張曉梅", "去", "人民", "民醫院", "醫院", "做", "了", "個", "B", "超然", "然後", "後去", "買", "了", "件", "T", "恤"},
		[]string{"AT", "T", "是", "一件", "不錯", "的", "公司", "", "", "給", "你", "發", "offer", "了", "嗎", "", ""},
		[]string{"C++", "和", "c#", "是", "什麼", "關係", "", "11+122", "133", "", "是", "嗎", "", "PI", "3", "14159"},
		[]string{"你", "認識", "那個", "和", "主席", "握手", "的", "的哥", "嗎", "", "", "他", "開", "一輛", "黑色", "的士", "", ""},
		[]string{"槍桿", "槍桿子", "桿子", "中出", "政權"},
	}

	defaultCutNoHMMResult = [][]string{[]string{"這", "是", "一個", "伸手不見五指", "的", "黑夜", "。", "我", "叫", "孫悟空", "，", "我", "愛", "北京", "，", "我", "愛", "Python", "和", "C++", "。"},
		[]string{"我", "不", "喜歡", "日本", "和服", "。"},
		[]string{"雷猴", "回歸", "人間", "。"},
		[]string{"工信處", "女幹事", "每月", "經過", "下屬", "科室", "都", "要", "親口", "交代", "24", "口", "交換機", "等", "技術性", "器件", "的", "安裝", "工作"},
		[]string{"我", "需要", "廉租房"},
		[]string{"永和", "服裝", "飾品", "有限公司"},
		[]string{"我", "愛", "北京", "天安門"},
		[]string{"abc"},
		[]string{"隱", "馬爾可夫"},
		[]string{"雷猴", "是", "個", "好", "網站"},
		[]string{"「", "Microsoft", "」", "一", "詞", "由", "「", "MICROcomputer", "（", "微型", "計算機", "）", "」", "和", "「", "SOFTware", "（", "軟件", "）", "」", "兩", "部分", "組成"},
		[]string{"草泥馬", "和", "欺", "實", "馬", "是", "今年", "的", "流行", "詞彙"},
		[]string{"伊", "藤", "洋華堂", "總府", "店"},
		[]string{"中國科學院計算技術研究所"},
		[]string{"羅密歐", "與", "朱麗葉"},
		[]string{"我", "購買", "了", "道具", "和", "服裝"},
		[]string{"PS", ":", " ", "我", "覺得", "開源", "有", "一個", "好處", "，", "就是", "能夠", "敦促", "自己", "不斷改進", "，", "避免", "敞", "帚", "自珍"},
		[]string{"湖北省", "石首市"},
		[]string{"湖北省", "十堰市"},
		[]string{"總經理", "完成", "了", "這件", "事情"},
		[]string{"電腦", "修好", "了"},
		[]string{"做好", "了", "這件", "事情", "就", "一了百了", "了"},
		[]string{"人們", "審美", "的", "觀點", "是", "不同", "的"},
		[]string{"我們", "買", "了", "一個", "美的", "空調"},
		[]string{"線程", "初始化", "時", "我們", "要", "注意"},
		[]string{"一個", "分子", "是", "由", "好多", "原子", "組織", "成", "的"},
		[]string{"祝", "你", "馬到功成"},
		[]string{"他", "掉", "進", "了", "無底洞", "里"},
		[]string{"中國", "的", "首都", "是", "北京"},
		[]string{"孫", "君", "意"},
		[]string{"外交部", "發言人", "馬朝旭"},
		[]string{"領導人", "會議", "和", "第四屆", "東亞", "峰會"},
		[]string{"在", "過去", "的", "這", "五年"},
		[]string{"還", "需要", "很", "長", "的", "路", "要", "走"},
		[]string{"60", "週年", "首都", "閱兵"},
		[]string{"你好", "人們", "審美", "的", "觀點", "是", "不同", "的"},
		[]string{"買", "水果", "然後", "來", "世博園"},
		[]string{"買", "水果", "然後", "去", "世博園"},
		[]string{"但是", "後來", "我", "才", "知道", "你", "是", "對", "的"},
		[]string{"存在", "即", "合理"},
		[]string{"的", "的", "的", "的", "的", "在", "的", "的", "的", "的", "就", "以", "和", "和", "和"},
		[]string{"I", " ", "love", "你", "，", "不以為恥", "，", "反", "以為", "rong"},
		[]string{"因"},
		[]string{},
		[]string{"hello", "你好", "人們", "審美", "的", "觀點", "是", "不同", "的"},
		[]string{"很", "好", "但", "主要", "是", "基於", "網頁", "形式"},
		[]string{"hello", "你好", "人們", "審美", "的", "觀點", "是", "不同", "的"},
		[]string{"為什麼", "我", "不能", "擁有", "想要", "的", "生活"},
		[]string{"後來", "我", "才"},
		[]string{"此次", "來", "中國", "是", "為了"},
		[]string{"使用", "了", "它", "就", "可以", "解決", "一些", "問題"},
		[]string{",", "使用", "了", "它", "就", "可以", "解決", "一些", "問題"},
		[]string{"其實", "使用", "了", "它", "就", "可以", "解決", "一些", "問題"},
		[]string{"好人", "使用", "了", "它", "就", "可以", "解決", "一些", "問題"},
		[]string{"是因為", "和", "國家"},
		[]string{"老年", "搜索", "還", "支持"},
		[]string{"乾脆", "就", "把", "那", "部", "蒙", "人", "的", "閒", "法", "給", "廢", "了", "拉倒", "！", "RT", " ", "@", "laoshipukong", " ", ":", " ", "27", "日", "，", "全國人大常委會", "第三次", "審議", "侵權", "責任法", "草案", "，", "刪除", "了", "有關", "醫療", "損害", "責任", "「", "舉證", "倒置", "」", "的", "規定", "。", "在", "醫患", "糾紛", "中", "本", "已", "處於", "弱勢", "地位", "的", "消費者", "由此", "將", "陷入", "萬劫不復", "的", "境地", "。", " "},
		[]string{"大"},
		[]string{},
		[]string{"他", "說", "的", "確實", "在", "理"},
		[]string{"長春", "市長", "春節", "講話"},
		[]string{"結婚", "的", "和", "尚未", "結婚", "的"},
		[]string{"結合", "成", "分子", "時"},
		[]string{"旅遊", "和", "服務", "是", "最好", "的"},
		[]string{"這件", "事情", "的確", "是", "我", "的", "錯"},
		[]string{"供", "大家", "參考", "指正"},
		[]string{"哈爾濱", "政府", "公佈", "塌", "橋", "原因"},
		[]string{"我", "在", "機場", "入口處"},
		[]string{"邢", "永", "臣", "攝影", "報道"},
		[]string{"BP", "神經網絡", "如何", "訓練", "才能", "在", "分類", "時", "增加", "區分度", "？"},
		[]string{"南京市", "長江大橋"},
		[]string{"應", "一些", "使用者", "的", "建議", "，", "也", "為了", "便於", "利用", "NiuTrans", "用於", "SMT", "研究"},
		[]string{"長春市", "長春", "藥店"},
		[]string{"鄧穎超", "生前", "最", "喜歡", "的", "衣服"},
		[]string{"胡錦濤", "是", "熱愛", "世界", "和平", "的", "政治局", "常委"},
		[]string{"程序員", "祝", "海林", "和", "朱", "會", "震", "是", "在", "孫", "健", "的", "左面", "和", "右面", ",", " ", "範", "凱", "在", "最", "右面", ".", "再", "往", "左", "是", "李", "松", "洪"},
		[]string{"一次性", "交", "多少", "錢"},
		[]string{"兩塊", "五", "一套", "，", "三塊", "八", "一斤", "，", "四塊", "七", "一本", "，", "五塊", "六", "一條"},
		[]string{"小", "和尚", "留", "了", "一個", "像", "大", "和尚", "一樣", "的", "和尚頭"},
		[]string{"我", "是", "中華人民共和國", "公民", ";", "我", "爸爸", "是", "共和黨", "黨員", ";", " ", "地鐵", "和平門", "站"},
		[]string{"張曉梅", "去", "人民", "醫院", "做", "了", "個", "B超", "然後", "去", "買", "了", "件", "T恤"},
		[]string{"AT&T", "是", "一件", "不錯", "的", "公司", "，", "給", "你", "發", "offer", "了", "嗎", "？"},
		[]string{"C++", "和", "c#", "是", "什麼", "關係", "？", "11", "+", "122", "=", "133", "，", "是", "嗎", "？", "PI", "=", "3", ".", "14159"},
		[]string{"你", "認識", "那個", "和", "主席", "握手", "的", "的哥", "嗎", "？", "他", "開", "一輛", "黑色", "的士", "。"},
		[]string{"槍桿子", "中", "出", "政權"},
	}

	cutForSearchResult = [][]string{[]string{"這是", "一個", "伸手", "不見", "五指", "伸手不見五指", "的", "黑夜", "。", "我", "叫", "悟空", "孫悟空", "，", "我", "愛", "北京", "，", "我", "愛", "Python", "和", "C++", "。"},
		[]string{"我", "不", "喜歡", "日本", "和服", "。"},
		[]string{"雷猴", "回歸", "人間", "。"},
		[]string{"工信處", "幹事", "女幹事", "每月", "經過", "下屬", "科室", "都", "要", "親口", "交代", "24", "口", "交換", "換機", "交換機", "等", "技術", "技術性", "器件", "的", "安裝", "工作"},
		[]string{"我", "需要", "廉租", "租房", "廉租房"},
		[]string{"永和", "服裝", "飾品", "有限", "公司", "有限公司"},
		[]string{"我", "愛", "北京", "天安", "天安門"},
		[]string{"abc"},
		[]string{"隱", "可夫", "馬爾可", "馬爾可夫"},
		[]string{"雷猴", "是", "個", "好", "網站"},
		[]string{"「", "Microsoft", "」", "一詞", "由", "「", "MICROcomputer", "（", "微型", "計算", "算機", "計算機", "）", "」", "和", "「", "SOFTware", "（", "軟件", "）", "」", "兩", "部分", "組成"},
		[]string{"草泥馬", "和", "欺實", "馬", "是", "今年", "的", "流行", "詞彙"},
		[]string{"伊藤", "洋華堂", "總府", "店"},
		[]string{"中國", "科學", "學院", "計算", "技術", "研究", "科學院", "研究所", "中國科學院計算技術研究所"},
		[]string{"羅密歐", "與", "朱麗葉"},
		[]string{"我", "購買", "了", "道具", "和", "服裝"},
		[]string{"PS", ":", " ", "我", "覺得", "開源", "有", "一個", "好處", "，", "就是", "能夠", "敦促", "自己", "不斷", "改進", "不斷改進", "，", "避免", "敞帚", "自珍"},
		[]string{"湖北", "湖北省", "石首", "石首市"},
		[]string{"湖北", "湖北省", "十堰", "十堰市"},
		[]string{"經理", "總經理", "完成", "了", "這件", "事情"},
		[]string{"電腦", "修好", "了"},
		[]string{"做好", "了", "這件", "事情", "就", "一了百了", "了"},
		[]string{"人們", "審美", "的", "觀點", "是", "不同", "的"},
		[]string{"我們", "買", "了", "一個", "美的", "空調"},
		[]string{"線程", "初始", "初始化", "時", "我們", "要", "注意"},
		[]string{"一個", "分子", "是", "由", "好多", "原子", "組織", "成", "的"},
		[]string{"祝", "你", "馬到功成"},
		[]string{"他", "掉", "進", "了", "無底", "無底洞", "里"},
		[]string{"中國", "的", "首都", "是", "北京"},
		[]string{"孫君意"},
		[]string{"外交", "外交部", "發言", "發言人", "馬朝旭"},
		[]string{"領導", "領導人", "會議", "和", "第四", "四屆", "第四屆", "東亞", "峰會"},
		[]string{"在", "過去", "的", "這", "五年"},
		[]string{"還", "需要", "很長", "的", "路", "要", "走"},
		[]string{"60", "週年", "首都", "閱兵"},
		[]string{"你好", "人們", "審美", "的", "觀點", "是", "不同", "的"},
		[]string{"買", "水果", "然後", "來", "世博", "博園", "世博園"},
		[]string{"買", "水果", "然後", "去", "世博", "博園", "世博園"},
		[]string{"但是", "後來", "我", "才", "知道", "你", "是", "對", "的"},
		[]string{"存在", "即", "合理"},
		[]string{"的", "的", "的", "的", "的", "在", "的", "的", "的", "的", "就", "以", "和", "和", "和"},
		[]string{"I", " ", "love", "你", "，", "不以", "以為", "不以為恥", "，", "反", "以為", "rong"},
		[]string{"因"},
		[]string{},
		[]string{"hello", "你好", "人們", "審美", "的", "觀點", "是", "不同", "的"},
		[]string{"很", "好", "但", "主要", "是", "基於", "網頁", "形式"},
		[]string{"hello", "你好", "人們", "審美", "的", "觀點", "是", "不同", "的"},
		[]string{"什麼", "為什麼", "我", "不能", "擁有", "想要", "的", "生活"},
		[]string{"後來", "我", "才"},
		[]string{"此次", "來", "中國", "是", "為了"},
		[]string{"使用", "了", "它", "就", "可以", "解決", "一些", "問題"},
		[]string{",", "使用", "了", "它", "就", "可以", "解決", "一些", "問題"},
		[]string{"其實", "使用", "了", "它", "就", "可以", "解決", "一些", "問題"},
		[]string{"好人", "使用", "了", "它", "就", "可以", "解決", "一些", "問題"},
		[]string{"因為", "是因為", "和", "國家"},
		[]string{"老年", "搜索", "還", "支持"},
		[]string{"乾脆", "就", "把", "那部", "蒙人", "的", "閒法", "給", "廢", "了", "拉倒", "！", "RT", " ", "@", "laoshipukong", " ", ":", " ", "27", "日", "，", "全國", "國人", "人大", "常委", "委會", "常委會", "全國人大常委會", "第三", "三次", "第三次", "審議", "侵權", "責任", "責任法", "草案", "，", "刪除", "了", "有關", "醫療", "損害", "責任", "「", "舉證", "倒置", "」", "的", "規定", "。", "在", "醫患", "糾紛", "中本", "已", "處於", "弱勢", "地位", "的", "消費", "消費者", "由此", "將", "陷入", "不復", "萬劫不復", "的", "境地", "。", " "},
		[]string{"大"},
		[]string{},
		[]string{"他", "說", "的", "確實", "在理"},
		[]string{"長春", "市長", "春節", "講話"},
		[]string{"結婚", "的", "和", "尚未", "結婚", "的"},
		[]string{"結合", "成", "分子", "時"},
		[]string{"旅遊", "和", "服務", "是", "最好", "的"},
		[]string{"這件", "事情", "的確", "是", "我", "的", "錯"},
		[]string{"供", "大家", "參考", "指正"},
		[]string{"哈爾", "哈爾濱", "政府", "公佈", "塌橋", "原因"},
		[]string{"我", "在", "機場", "入口", "入口處"},
		[]string{"邢永臣", "攝影", "報道"},
		[]string{"BP", "神經", "網絡", "神經網", "神經網絡", "如何", "訓練", "才能", "在", "分類", "時", "增加", "區分", "分度", "區分度", "？"},
		[]string{"南京", "京市", "南京市", "長江", "大橋", "長江大橋"},
		[]string{"應", "一些", "使用", "用者", "使用者", "的", "建議", "，", "也", "為了", "便於", "利用", "NiuTrans", "用於", "SMT", "研究"},
		[]string{"長春", "長春市", "長春", "藥店"},
		[]string{"鄧穎超", "生前", "最", "喜歡", "的", "衣服"},
		[]string{"錦濤", "胡錦濤", "是", "熱愛", "世界", "和平", "的", "政治", "政治局", "常委"},
		[]string{"程序", "程序員", "祝", "海林", "和", "朱會震", "是", "在", "孫健", "的", "左面", "和", "右面", ",", " ", "範凱", "在", "最", "右面", ".", "再往", "左", "是", "李松洪"},
		[]string{"一次", "一次性", "交", "多少", "錢"},
		[]string{"兩塊", "五", "一套", "，", "三塊", "八", "一斤", "，", "四塊", "七", "一本", "，", "五塊", "六", "一條"},
		[]string{"小", "和尚", "留", "了", "一個", "像", "大", "和尚", "一樣", "的", "和尚", "和尚頭"},
		[]string{"我", "是", "中華", "華人", "人民", "共和", "共和國", "中華人民共和國", "公民", ";", "我", "爸爸", "是", "共和", "共和黨", "黨員", ";", " ", "地鐵", "和平", "和平門", "站"},
		[]string{"張曉梅", "去", "人民", "醫院", "做", "了", "個", "B超", "然後", "去", "買", "了", "件", "T恤"},
		[]string{"AT&T", "是", "一件", "不錯", "的", "公司", "，", "給", "你", "發", "offer", "了", "嗎", "？"},
		[]string{"C++", "和", "c#", "是", "什麼", "關係", "？", "11", "+", "122", "=", "133", "，", "是", "嗎", "？", "PI", "=", "3.14159"},
		[]string{"你", "認識", "那個", "和", "主席", "握手", "的", "的哥", "嗎", "？", "他開", "一輛", "黑色", "的士", "。"},
		[]string{"槍桿", "桿子", "槍桿子", "中", "出", "政權"},
	}

	cutForSearchNoHMMResult = [][]string{[]string{"這", "是", "一個", "伸手", "不見", "五指", "伸手不見五指", "的", "黑夜", "。", "我", "叫", "悟空", "孫悟空", "，", "我", "愛", "北京", "，", "我", "愛", "Python", "和", "C++", "。"},
		[]string{"我", "不", "喜歡", "日本", "和服", "。"},
		[]string{"雷猴", "回歸", "人間", "。"},
		[]string{"工信處", "幹事", "女幹事", "每月", "經過", "下屬", "科室", "都", "要", "親口", "交代", "24", "口", "交換", "換機", "交換機", "等", "技術", "技術性", "器件", "的", "安裝", "工作"},
		[]string{"我", "需要", "廉租", "租房", "廉租房"},
		[]string{"永和", "服裝", "飾品", "有限", "公司", "有限公司"},
		[]string{"我", "愛", "北京", "天安", "天安門"},
		[]string{"abc"},
		[]string{"隱", "可夫", "馬爾可", "馬爾可夫"},
		[]string{"雷猴", "是", "個", "好", "網站"},
		[]string{"「", "Microsoft", "」", "一", "詞", "由", "「", "MICROcomputer", "（", "微型", "計算", "算機", "計算機", "）", "」", "和", "「", "SOFTware", "（", "軟件", "）", "」", "兩", "部分", "組成"},
		[]string{"草泥馬", "和", "欺", "實", "馬", "是", "今年", "的", "流行", "詞彙"},
		[]string{"伊", "藤", "洋華堂", "總府", "店"},
		[]string{"中國", "科學", "學院", "計算", "技術", "研究", "科學院", "研究所", "中國科學院計算技術研究所"},
		[]string{"羅密歐", "與", "朱麗葉"},
		[]string{"我", "購買", "了", "道具", "和", "服裝"},
		[]string{"PS", ":", " ", "我", "覺得", "開源", "有", "一個", "好處", "，", "就是", "能夠", "敦促", "自己", "不斷", "改進", "不斷改進", "，", "避免", "敞", "帚", "自珍"},
		[]string{"湖北", "湖北省", "石首", "石首市"},
		[]string{"湖北", "湖北省", "十堰", "十堰市"},
		[]string{"經理", "總經理", "完成", "了", "這件", "事情"},
		[]string{"電腦", "修好", "了"},
		[]string{"做好", "了", "這件", "事情", "就", "一了百了", "了"},
		[]string{"人們", "審美", "的", "觀點", "是", "不同", "的"},
		[]string{"我們", "買", "了", "一個", "美的", "空調"},
		[]string{"線程", "初始", "初始化", "時", "我們", "要", "注意"},
		[]string{"一個", "分子", "是", "由", "好多", "原子", "組織", "成", "的"},
		[]string{"祝", "你", "馬到功成"},
		[]string{"他", "掉", "進", "了", "無底", "無底洞", "里"},
		[]string{"中國", "的", "首都", "是", "北京"},
		[]string{"孫", "君", "意"},
		[]string{"外交", "外交部", "發言", "發言人", "馬朝旭"},
		[]string{"領導", "領導人", "會議", "和", "第四", "四屆", "第四屆", "東亞", "峰會"},
		[]string{"在", "過去", "的", "這", "五年"},
		[]string{"還", "需要", "很", "長", "的", "路", "要", "走"},
		[]string{"60", "週年", "首都", "閱兵"},
		[]string{"你好", "人們", "審美", "的", "觀點", "是", "不同", "的"},
		[]string{"買", "水果", "然後", "來", "世博", "博園", "世博園"},
		[]string{"買", "水果", "然後", "去", "世博", "博園", "世博園"},
		[]string{"但是", "後來", "我", "才", "知道", "你", "是", "對", "的"},
		[]string{"存在", "即", "合理"},
		[]string{"的", "的", "的", "的", "的", "在", "的", "的", "的", "的", "就", "以", "和", "和", "和"},
		[]string{"I", " ", "love", "你", "，", "不以", "以為", "不以為恥", "，", "反", "以為", "rong"},
		[]string{"因"},
		[]string{},
		[]string{"hello", "你好", "人們", "審美", "的", "觀點", "是", "不同", "的"},
		[]string{"很", "好", "但", "主要", "是", "基於", "網頁", "形式"},
		[]string{"hello", "你好", "人們", "審美", "的", "觀點", "是", "不同", "的"},
		[]string{"什麼", "為什麼", "我", "不能", "擁有", "想要", "的", "生活"},
		[]string{"後來", "我", "才"},
		[]string{"此次", "來", "中國", "是", "為了"},
		[]string{"使用", "了", "它", "就", "可以", "解決", "一些", "問題"},
		[]string{",", "使用", "了", "它", "就", "可以", "解決", "一些", "問題"},
		[]string{"其實", "使用", "了", "它", "就", "可以", "解決", "一些", "問題"},
		[]string{"好人", "使用", "了", "它", "就", "可以", "解決", "一些", "問題"},
		[]string{"因為", "是因為", "和", "國家"},
		[]string{"老年", "搜索", "還", "支持"},
		[]string{"乾脆", "就", "把", "那", "部", "蒙", "人", "的", "閒", "法", "給", "廢", "了", "拉倒", "！", "RT", " ", "@", "laoshipukong", " ", ":", " ", "27", "日", "，", "全國", "國人", "人大", "常委", "委會", "常委會", "全國人大常委會", "第三", "三次", "第三次", "審議", "侵權", "責任", "責任法", "草案", "，", "刪除", "了", "有關", "醫療", "損害", "責任", "「", "舉證", "倒置", "」", "的", "規定", "。", "在", "醫患", "糾紛", "中", "本", "已", "處於", "弱勢", "地位", "的", "消費", "消費者", "由此", "將", "陷入", "不復", "萬劫不復", "的", "境地", "。", " "},
		[]string{"大"},
		[]string{},
		[]string{"他", "說", "的", "確實", "在", "理"},
		[]string{"長春", "市長", "春節", "講話"},
		[]string{"結婚", "的", "和", "尚未", "結婚", "的"},
		[]string{"結合", "成", "分子", "時"},
		[]string{"旅遊", "和", "服務", "是", "最好", "的"},
		[]string{"這件", "事情", "的確", "是", "我", "的", "錯"},
		[]string{"供", "大家", "參考", "指正"},
		[]string{"哈爾", "哈爾濱", "政府", "公佈", "塌", "橋", "原因"},
		[]string{"我", "在", "機場", "入口", "入口處"},
		[]string{"邢", "永", "臣", "攝影", "報道"},
		[]string{"BP", "神經", "網絡", "神經網", "神經網絡", "如何", "訓練", "才能", "在", "分類", "時", "增加", "區分", "分度", "區分度", "？"},
		[]string{"南京", "京市", "南京市", "長江", "大橋", "長江大橋"},
		[]string{"應", "一些", "使用", "用者", "使用者", "的", "建議", "，", "也", "為了", "便於", "利用", "NiuTrans", "用於", "SMT", "研究"},
		[]string{"長春", "長春市", "長春", "藥店"},
		[]string{"鄧穎超", "生前", "最", "喜歡", "的", "衣服"},
		[]string{"錦濤", "胡錦濤", "是", "熱愛", "世界", "和平", "的", "政治", "政治局", "常委"},
		[]string{"程序", "程序員", "祝", "海林", "和", "朱", "會", "震", "是", "在", "孫", "健", "的", "左面", "和", "右面", ",", " ", "範", "凱", "在", "最", "右面", ".", "再", "往", "左", "是", "李", "松", "洪"},
		[]string{"一次", "一次性", "交", "多少", "錢"},
		[]string{"兩塊", "五", "一套", "，", "三塊", "八", "一斤", "，", "四塊", "七", "一本", "，", "五塊", "六", "一條"},
		[]string{"小", "和尚", "留", "了", "一個", "像", "大", "和尚", "一樣", "的", "和尚", "和尚頭"},
		[]string{"我", "是", "中華", "華人", "人民", "共和", "共和國", "中華人民共和國", "公民", ";", "我", "爸爸", "是", "共和", "共和黨", "黨員", ";", " ", "地鐵", "和平", "和平門", "站"},
		[]string{"張曉梅", "去", "人民", "醫院", "做", "了", "個", "B超", "然後", "去", "買", "了", "件", "T恤"},
		[]string{"AT&T", "是", "一件", "不錯", "的", "公司", "，", "給", "你", "發", "offer", "了", "嗎", "？"},
		[]string{"C++", "和", "c#", "是", "什麼", "關係", "？", "11", "+", "122", "=", "133", "，", "是", "嗎", "？", "PI", "=", "3", ".", "14159"},
		[]string{"你", "認識", "那個", "和", "主席", "握手", "的", "的哥", "嗎", "？", "他", "開", "一輛", "黑色", "的士", "。"},
		[]string{"槍桿", "桿子", "槍桿子", "中", "出", "政權"},
	}

	userDictCutResult = [][]string{
		[]string{"這是", "一個", "伸手", "不見", "五指", "的", "黑夜", "。", "我", "叫", "孫悟空", "，", "我", "愛北京", "，", "我", "愛", "Python", "和", "C", "++", "。"},
		[]string{"我", "不", "喜歡", "日本", "和", "服", "。"},
		[]string{"雷猴", "回歸人間", "。"},
		[]string{"工信", "處女", "幹事", "每", "月", "經過", "下", "屬", "科室", "都", "要", "親口", "交代", "24", "口交換機", "等", "技術性", "器件", "的", "安裝", "工作"},
		[]string{"我", "需要", "廉租房"},
		[]string{"永和服", "裝飾品", "有", "限公司"},
		[]string{"我", "愛北京", "天安門"},
		[]string{"abc"},
		[]string{"隱馬爾", "可夫"},
		[]string{"雷猴", "是", "個", "好", "網站"},
		[]string{"「", "Microsoft", "」", "一詞", "由", "「", "MICROcomputer", "（", "微型", "計算機", "）", "」", "和", "「", "SOFTware", "（", "軟件", "）", "」", "兩部分", "組成"},
		[]string{"草泥", "馬", "和", "欺實", "馬", "是", "今", "年", "的", "流行", "詞彙"},
		[]string{"伊藤洋華堂", "總府", "店"},
		[]string{"中國", "科學院", "計算", "技術", "研究", "所"},
		[]string{"羅密歐", "與", "朱麗葉"},
		[]string{"我購", "買", "了", "道", "具", "和", "服裝"},
		[]string{"PS", ":", " ", "我覺", "得", "開源", "有", "一個", "好", "處", "，", "就", "是", "能夠", "敦促", "自己", "不斷", "改進", "，", "避免", "敞帚", "自珍"},
		[]string{"湖北省", "石首市"},
		[]string{"湖北省", "十堰市"},
		[]string{"總經理", "完成", "了", "這件", "事情"},
		[]string{"電腦", "修好", "了"},
		[]string{"做", "好", "了", "這件", "事情", "就", "一", "了", "百", "了", "了"},
		[]string{"人們", "審美", "的", "觀點", "是", "不同", "的"},
		[]string{"我們", "買", "了", "一個", "美", "的", "空調"},
		[]string{"線程", "初始", "化時", "我們", "要", "注意"},
		[]string{"一個", "分子", "是", "由", "好", "多", "原子", "組織成", "的"},
		[]string{"祝", "你", "馬到", "功成"},
		[]string{"他", "掉", "進", "了", "無底", "洞里"},
		[]string{"中國", "的", "首", "都", "是", "北京"},
		[]string{"孫君意"},
		[]string{"外交部", "發言人", "馬朝旭"},
		[]string{"領導", "人會議", "和", "第四屆", "東亞峰", "會"},
		[]string{"在", "過", "去", "的", "這五年"},
		[]string{"還", "需要", "很長", "的", "路", "要", "走"},
		[]string{"60", "週年首", "都", "閱兵"},
		[]string{"你", "好人", "們", "審美", "的", "觀點", "是", "不同", "的"},
		[]string{"買水果", "然後", "來", "世博園"},
		[]string{"買水果", "然後", "去", "世博園"},
		[]string{"但", "是", "後", "來", "我", "才", "知道", "你", "是", "對", "的"},
		[]string{"存在", "即", "合理"},
		[]string{"的", "的", "的", "的", "的", "在", "的", "的", "的", "的", "就", "以", "和", "和", "和"},
		[]string{"I", " ", "love", "你", "，", "不以", "為恥", "，", "反以", "為", "rong"},
		[]string{"因"},
		[]string{},
		[]string{"hello", "你", "好人", "們", "審美", "的", "觀點", "是", "不同", "的"},
		[]string{"很", "好", "但", "主要", "是", "基於", "網頁", "形式"},
		[]string{"hello", "你", "好人", "們", "審美", "的", "觀點", "是", "不同", "的"},
		[]string{"為", "什麼", "我", "不能", "擁有", "想", "要", "的", "生活"},
		[]string{"後來", "我", "才"},
		[]string{"此次", "來", "中國", "是", "為", "了"},
		[]string{"使用", "了", "它", "就", "可以", "解決", "一些", "問題"},
		[]string{",", "使用", "了", "它", "就", "可以", "解決", "一些", "問題"},
		[]string{"其實", "使", "用", "了", "它", "就", "可以", "解決", "一些", "問題"},
		[]string{"好人", "使用", "了", "它", "就", "可以", "解決", "一些", "問題"},
		[]string{"是", "因為", "和", "國家"},
		[]string{"老年", "搜索", "還", "支持"},
		[]string{"乾脆", "就", "把", "那部", "蒙人", "的", "閒法", "給", "廢", "了", "拉", "倒", "！", "RT", " ", "@", "laoshipukong", " ", ":", " ", "27", "日", "，", "全國人", "大常委會", "第三次", "審議", "侵權責", "任法", "草案", "，", "刪除", "了", "有", "關醫療", "損害", "責任", "「", "舉證", "倒", "置", "」", "的", "規定", "。", "在", "醫患", "糾紛", "中本", "已", "處於", "弱勢", "地位", "的", "消費者", "由", "此", "將", "陷入", "萬劫", "不復", "的", "境地", "。", " "},
		[]string{"大"},
		[]string{},
		[]string{"他", "說", "的", "確實", "在", "理"},
		[]string{"長春市", "長春節", "講話"},
		[]string{"結婚", "的", "和", "尚未", "結婚", "的"},
		[]string{"結合成", "分子", "時"},
		[]string{"旅遊", "和", "服務", "是", "最", "好", "的"},
		[]string{"這件", "事情", "的", "確是", "我", "的", "錯"},
		[]string{"供大家", "參考", "指正"},
		[]string{"哈爾濱", "政府", "公佈塌橋", "原因"},
		[]string{"我", "在", "機場", "入口", "處"},
		[]string{"邢永臣", "攝影", "報道"},
		[]string{"BP", "神經", "網絡", "如何", "訓練", "才", "能", "在", "分類", "時", "增加區", "分度", "？"},
		[]string{"南京市", "長江大橋"},
		[]string{"應一些", "使", "用者", "的", "建議", "，", "也", "為", "了", "便", "於", "利用", "NiuTrans", "用於", "SMT", "研究"},
		[]string{"長春市", "長春藥店"},
		[]string{"鄧穎", "超生", "前", "最", "喜歡", "的", "衣服"},
		[]string{"胡錦濤", "是", "熱愛世界", "和", "平", "的", "政治局", "常委"},
		[]string{"程序員", "祝海林", "和", "朱會震", "是", "在", "孫健", "的", "左面", "和", "右面", ",", " ", "範凱", "在", "最右面", ".", "再往", "左", "是", "李松洪"},
		[]string{"一次性", "交多少", "錢"},
		[]string{"兩塊", "五一套", "，", "三塊", "八一斤", "，", "四塊", "七", "一本", "，", "五塊", "六", "一條"},
		[]string{"小", "和", "尚留", "了", "一個", "像", "大", "和", "尚", "一樣", "的", "和", "尚頭"},
		[]string{"我", "是", "中華人民共和國", "公民", ";", "我", "爸爸", "是", "共", "和", "黨", "黨員", ";", " ", "地鐵", "和", "平門", "站"},
		[]string{"張曉梅", "去", "人民醫院", "做", "了", "個", "B", "超然", "後", "去", "買", "了", "件", "T", "恤"},
		[]string{"AT", "&", "T", "是", "一件", "不錯", "的", "公司", "，", "給", "你", "發", "offer", "了", "嗎", "？"},
		[]string{"C", "++", "和", "c", "#", "是", "什麼", "關係", "？", "11", "+", "122", "=", "133", "，", "是", "嗎", "？", "PI", "=", "3.14159"},
		[]string{"你", "認識", "那個", "和", "主席握", "手", "的", "的", "哥", "嗎", "？", "他開", "一輛", "黑色", "的", "士", "。"},
		[]string{"槍桿子", "中", "出政權"},
	}
)

func init() {
	seg.LoadDictionary("dict.txt")
}

func chanToArray(ch <-chan string) []string {
	var result []string
	for word := range ch {
		result = append(result, word)
	}
	return result
}

func TestCutDAG(t *testing.T) {
	result := chanToArray(seg.cutDAG("BP神經網絡如何訓練才能在分類時增加區分度？"))
	if len(result) != 11 {
		t.Fatal(result)
	}
}

func TestCutDAGNoHmm(t *testing.T) {
	result := chanToArray(seg.cutDAGNoHMM("BP神經網絡如何訓練才能在分類時增加區分度？"))
	if len(result) != 11 {
		t.Fatal(result)
	}
}

func TestDefaultCut(t *testing.T) {
	var result []string
	for index, content := range testContents {
		result = chanToArray(seg.Cut(content, true))
		if len(result) != len(defaultCutResult[index]) {
			t.Errorf("default cut for %s length should be %d not %d\n",
				content, len(defaultCutResult[index]), len(result))
			t.Errorf("expect: %v\n", defaultCutResult[index])
			t.Fatalf("got: %v\n", result)
		}
		for i, r := range result {
			if r != defaultCutResult[index][i] {
				t.Logf("expect %v\n", defaultCutResult[index])
				t.Logf("got %v\n", result)
				t.Fatal(r)
			}
		}
	}
}

func TestCutAll(t *testing.T) {
	var result []string
	for index, content := range testContents {
		result = chanToArray(seg.CutAll(content))
		if len(result) != len(cutAllResult[index]) {
			t.Errorf("cut all for %s length should be %d not %d\n",
				content, len(cutAllResult[index]), len(result))
			t.Errorf("expect: %v\n", defaultCutResult[index])
			t.Fatalf("got: %v\n", result)
		}
		for i, c := range result {
			if c != cutAllResult[index][i] {
				t.Logf("expect %v\n", cutAllResult[index])
				t.Logf("got %v\n", result)
				t.Fatal(c)
			}
		}
	}
}

func TestDefaultCutNoHMM(t *testing.T) {
	var result []string
	for index, content := range testContents {
		result = chanToArray(seg.Cut(content, false))
		if len(result) != len(defaultCutNoHMMResult[index]) {
			t.Fatalf("default cut no hmm for %s length should be %d not %d\n",
				content, len(defaultCutNoHMMResult[index]), len(result))
		}
		for i, c := range result {
			if c != defaultCutNoHMMResult[index][i] {
				t.Logf("expect %v\n", defaultCutNoHMMResult[index])
				t.Logf("got %v\n", result)
				t.Fatal(c)
			}
		}
	}
}

func TestCutForSearch(t *testing.T) {
	var result []string
	for index, content := range testContents {
		result = chanToArray(seg.CutForSearch(content, true))
		if len(result) != len(cutForSearchResult[index]) {
			t.Logf("expect %v\n", cutForSearchResult[index])
			t.Logf("got %v\n", result)
			t.Fatalf("cut for search for %s length should be %d not %d\n",
				content, len(cutForSearchResult[index]), len(result))
		}
		for i, c := range result {
			if c != cutForSearchResult[index][i] {
				t.Logf("expect %v\n", cutForSearchResult[index])
				t.Logf("got %v\n", result)
				t.Fatal(c)
			}
		}
	}
	for index, content := range testContents {
		result = chanToArray(seg.CutForSearch(content, false))
		if len(result) != len(cutForSearchNoHMMResult[index]) {
			t.Fatalf("cut for search no hmm for %s length should be %d not %d\n",
				content, len(cutForSearchNoHMMResult[index]), len(result))
		}
		for i, c := range result {
			if c != cutForSearchNoHMMResult[index][i] {
				t.Logf("expect %v\n", cutForSearchNoHMMResult[index])
				t.Logf("got %v\n", result)
				t.Fatal(c)
			}
		}
	}
}

func TestLoadDictionary(t *testing.T) {
	var result []string
	seg.LoadDictionary("foobar.txt")
	for index, content := range testContents {
		result = chanToArray(seg.Cut(content, true))
		if len(result) != len(userDictCutResult[index]) {
			t.Fatalf("default cut with user dictionary for %s length should be %d not %d\n",
				content, len(userDictCutResult[index]), len(result))
		}
		for i, c := range result {
			if c != userDictCutResult[index][i] {
				t.Logf("expect %v\n", userDictCutResult[index])
				t.Logf("got %v\n", result)
				t.Fatal(c)
			}
		}
	}
	seg.LoadDictionary("dict.txt")
}

func TestLoadUserDictionary(t *testing.T) {
	seg.LoadUserDictionary("userdict.txt")

	sentence := "李小福是創新辦主任也是雲計算方面的專家; 什麼是八一雙鹿例如我輸入一個帶「韓玉賞鑒」的標題，在自定義詞庫中也增加了此詞為N類型"
	result := []string{"李小福", "是", "創新辦", "主任", "也", "是", "雲計算", "方面", "的", "專家", ";", " ", "什麼", "是", "八一雙鹿", "例如", "我", "輸入", "一個", "帶", "「", "韓玉賞鑒", "」", "的", "標題", "，", "在", "自定義詞", "庫中", "也", "增加", "了", "此", "詞為", "N", "類型"}

	words := chanToArray(seg.Cut(sentence, true))
	if len(words) != len(result) {
		t.Fatal(len(words))
	}
	for index, word := range words {
		if word != result[index] {
			t.Fatal(word)
		}
	}

	sentence = "easy_install is great"
	result = []string{"easy_install", " ", "is", " ", "great"}
	words = chanToArray(seg.Cut(sentence, true))
	if len(words) != len(result) {
		t.Fatal(len(words))
	}
	for index, word := range words {
		if word != result[index] {
			t.Fatal(word)
		}
	}

	sentence = "python 的正則表達式是好用的"
	result = []string{"python", " ", "的", "正則表達式", "是", "好用", "的"}
	words = chanToArray(seg.Cut(sentence, true))
	if len(words) != len(result) {
		t.Fatal(words)
		t.Fatal(result)
	}
	for index, word := range words {
		if word != result[index] {
			t.Fatal(word)
		}
	}
	seg.LoadDictionary("dict.txt")
}

func BenchmarkCutNoHMM(b *testing.B) {
	sentence := "工信處女幹事每月經過下屬科室都要親口交代24口交換機等技術性器件的安裝工作"
	b.ResetTimer()
	for i := 0; i < b.N; i++ {
		chanToArray(seg.Cut(sentence, false))
	}
}

func BenchmarkCut(b *testing.B) {
	sentence := "工信處女幹事每月經過下屬科室都要親口交代24口交換機等技術性器件的安裝工作"
	b.ResetTimer()
	for i := 0; i < b.N; i++ {
		chanToArray(seg.Cut(sentence, true))
	}
}

func BenchmarkCutAll(b *testing.B) {
	sentence := "工信處女幹事每月經過下屬科室都要親口交代24口交換機等技術性器件的安裝工作"
	b.ResetTimer()
	for i := 0; i < b.N; i++ {
		chanToArray(seg.CutAll(sentence))
	}
}

func BenchmarkCutForSearchNoHMM(b *testing.B) {
	sentence := "工信處女幹事每月經過下屬科室都要親口交代24口交換機等技術性器件的安裝工作"
	b.ResetTimer()
	for i := 0; i < b.N; i++ {
		chanToArray(seg.CutForSearch(sentence, false))
	}
}

func BenchmarkCutForSearch(b *testing.B) {
	sentence := "工信處女幹事每月經過下屬科室都要親口交代24口交換機等技術性器件的安裝工作"
	b.ResetTimer()
	for i := 0; i < b.N; i++ {
		chanToArray(seg.CutForSearch(sentence, true))
	}
}
